CSI API ETABS v1

# cDStAISC360_10 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDStAISC360_10

    Public Interface cDStAISC360_10

    Dim instance As cDStAISC360_10

    public interface class cDStAISC360_10

    type cDStAISC360_10 =  interface end

The cDStAISC360_10 type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetOverwrite|
|
GetPreference|
| [SetOverwrite](eccc6c7d-b6ae-
ab55-4591-7320d55b0d3b.htm)|
|
SetPreference|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com